#include <stdio.h>
#include <stdlib.h>

// 請運用for迴圈, 計算1 ^ 2 + 2 ^ 2 + 3 ^ 2 + … + 10 ^ 2

int ex4(void)
{
	int i, a = 1, sum = 0, b = 0;   //設4個變數，i,a(數字初值為1),sum(總和初值為0),b(平方後的變數，初值等於0)
	for (i = 1; i <= 10; i++)       //for迴圈，i等於1，直到i小於等於10之前，都會加1
	{
		b = a*a;                    //一開始是 1*1=1   第二次做就是 2*2=4 以此類推......
		a = a + 1;                  //執行完1*1之後，變數a要加1，等到重複迴圈時，就會變成2*2
		sum = sum + b;              //1*1=1完之後會加到總和，故總和1+0=1 第二次做就是 1+4=5 以此類推......
	}
	printf("%d\n", sum);            //當迴圈執行完10次之後，跳出來，用字串顯示答案
}
